# taps
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# brews
brew "glib"
brew "python@3.8", link: true
brew "doctl"
brew "go"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "postgresql", restart_service: true
brew "postgresql@12"
brew "rbenv"
brew "starship"
brew "heroku/brew/heroku"

# casks
cask "font-fantasque-sans-mono"
cask "font-hack-nerd-font"
cask "graphql-playground"
