# taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "twostraws/brew"

# brews
brew "doctl"
brew "go"
brew "mas"
brew "postgresql", restart_service: true
brew "postgresql@12"
brew "python@3.8", link: true
brew "rbenv"
brew "sitrep"
brew "starship"
brew "swiftlint"

# casks
cask "discord"
cask "firefox"
cask "font-fantasque-sans-mono"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "iterm2"
cask "paw"
cask "sf-symbols"
cask "spotify"
cask "steam"
cask "tableplus"
cask "visual-studio-code"
cask "zoom"

# mac app store
mas "1Password", id: 443987910
mas "Fantastical", id: 975937182
mas "Paste", id: 967805235
mas "Slack", id: 803453959
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
