# taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "twostraws/brew"

# brews
brew "asdf"
brew "mas"
brew "starship"
#brew "sitrep"
#brew "swiftlint"

# casks
cask "arc"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fantasque-sans-mono"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-cascadia-code"
cask "google-chrome"
cask "github"
cask "paw"
cask "raycast"
cask "rescuetime"
cask "spotify"
cask "steam"
cask "tableplus"
cask "visual-studio-code"
cask "warp"
cask "zed"
cask "zoom"

# mac app store
#mas "1Password", id: 443987910
mas "Slack", id: 803453959
#mas "Xcode", id: 497799835
